TEXT_START = """ Привет👋 Меня зовут **Rocket Helper** и я твой коллега 😊

Я рад тебя приветвовать в нашей вселенной **Rocket Tech School**!🚀
Чтобы со мной взаимодействовать, тебе нужно написать **'/'** в любом доступном тебе канале и тебе **будут доступны крутые команды!**

Чтобы узнать больше обо мне напиши:
**/about**

Чтобы посмотреть весь список команд напиши:
**/cmd**

"""

TEXT_SCRIPTS = """
🔹*ОС для родителей* 
_Cкрипт, который ты сможешь отправить родителям по успехам их ребенка_

🔻*Admins*
_Cкрипт для переноса/отмены регулярного урока, который ты можешь отправлять администраторам_

🔸*Перенос ПУ*
_Cкрипт для переноса пробного урока на другого преподавателя_ 

*Рекомендую также посмотреть статью про правила отмены и переноса урока, чтобы сделать все правильно:*
https://www.notion.so/rtschool/2070544c19144ec0abd1d4975596e758

"""
TEXT_FAQ = """
1️⃣ *Обучение*
_Вопросы, которые связаны с этапами обучения и работой_

2️⃣ *Окончание обучения (и/или стажировки)*
_Вопросы, которые связаны с первыми шагами после окончания обучения_

3️⃣ *Карточка урока*
_Вопросы, которые связаны с карточкой урока и всевозможными манипуляциями с ней_

4️⃣ *Программы для проведения и записи уроков*
_Вопросы, которые связаны с программами для проведения урока, записями, поисками записей урока и так далее_

5️⃣ *Технические проблемы*
_Вопросы, которые связаны с тех. проблемами на рабочем сервере, на уроке, на ученическом сервере_

6️⃣ *Время работы отделов*
_Когда работают нужные тебе отделы и когда нужно решать вопросы, чтобы тебе еще отвечали_
"""
TEXT_HELP = """
Если у тебя срочный вопрос, то можешь написать другим наставникам 

Список всех наставников:
"""
TEXT_USEFUL="""⬇️ Полезные ссылки ⬇️"""
TEXT_NOTION = """🚀 Космическая база знаний"""
TEXT_GETCOURSE = """🚀 Космическое обучение на GetCourse """

SERVERS = """

🚀 RTS-1 - https://discord.gg/ZuEEJrbMfg

🚀 RTS-2 - https://discord.gg/tSbnGXzUwk

🚀 RTS-3 - https://discord.gg/zcdsc3Wh4U

🚀 RTS-4 - https://discord.gg/VEDKFY3ca2

🚀 RTS-5 - https://discord.gg/ZFrgGXr8pC

🚀 RTS-6 - https://discord.gg/PQ4HStFujZ

🚀 RTS-7 - https://discord.gg/8hRNV8BEWG

🚀 RTS-8 - https://discord.gg/UvJ78xdBHm

🚀 RTS-9 - https://discord.gg/a4Ze5MV85u

🚀 RTS International Community - https://discord.gg/d2NjNrPaWd

🚀 Rocket Tech Games - https://discord.gg/Mk9Fg8V55f
"""
END_Q1 = """
Если ты прошёл стажировку, то настало время присоединиться к основной команде!
Тимлид свяжется с тобой в течение суток после окончания стажировки и назначит тебе созвон-знакомство.
В любом случае ты сможешь обращаться к наставнику, но уже как к коллеге - они всегда рады помочь тебе!
"""
END_Q2 = """
К сожалению, такое сделать не получитсяю, но наши тимлиды самые крутые и классные сотрудники,
которые обязательно позаботятся о тебе как о работнике! 
Ты сможешь обращаться с любыми вопросами к тимлиду или наставнику (но, к наставнику уже как к коллеге)
"""
END_Q3 = """
Чтобы получить квалификацию по новому предмету, то нужно написать своему тимлиду с просьбой открыть тебе обучение.
После прохождения обучения, в конце ты отправишь свой проект на проверку нашим методистам.

Срок проверки твоего проекта - 2 дня. 

По результатам проверки методист свяжется с твоим тимлидом и он 
с радостью выставит тебе новую квалификацию!
"""
TRAINING_Q1 = """
Экзамен - это выполнение разного рода заданий в режиме онлайн по предметам, которые ты будешь вести. 
На экзамене можно получить сразу несколько квалификаций, это значит, что если ты решишь задания по нескольким предметам, то сможешь вести по этим же предметам регулярные уроки. 
Среди заданий может быть объяснение кода, ответы на вопросы наставника и другие задания, которые покажут нам уровень твоей компетентности в данном предмете.
"""
TRAINING_Q2 = """
Стажировка - это от 2 до 6 регулярных или пробных уроков, которые проводятся с помощью наставника - он, по возможности, подключается на первый урок, помогает заполнить карточку урока, решить возможные проблемы в чате, а по остальным урокам даёт обратную связь, посмотрев запись урока. 
Чтобы получить эти уроки, нужно не менее 15 открытых часов в расписании и квалификация (предмет).
Имейте в виду, что ученики с регулярных уроков останутся в расписании и после прохождения стажировки, т.к. уроки регулярные, поэтому будьте внимательны к тому, какие часы открыты, уроки могут поставить в любой из них, делайте это с оглядкой на то, что сможете работать в этот день и время всегда. 
Также, если произойдёт форс-мажор - обязательно пиши!
К сожалению, если педагог не выходит на связь 24 часа без предупреждения заранее, мы вынуждены передать всех его учеников другим педагогам и попрощаться, очень важно быть на связи.
"""
TRAINING_Q3 = """
Как только ты завершил успешно экзамен и получил квалификации по предметам, то мы передаем тебя в нужные отделы, чтобы на тебя обратили внимание.
Время получения уроков зависит от открытого рабочего времени в AlfaCRM, а также от предметов.
В среднем на получение первого урока уходит от 3-4 дней.
"""
TRAINING_Q4 = """
Подробно про этот вопрос ты можешь почитать по ссылке ниже. 
Но в любом случае все нужно делать заранее!

https://www.notion.so/rtschool/2070544c19144ec0abd1d4975596e758
"""
TRAINING_Q5 = """
Чтобы найти себе замену в первую очередь тебе нужно написать в канал new_lessons.
Там ты можешь найти себе доп. урок, а также найти замену на свой урок.

⚠️ **WARNING** ⚠️  
НЕЛЬЗЯ спамить во все чаты о поиске замены, от этого замена не найдется, а к тебе будут вопросы за нарушение правил. 
Давайте уважать друг друга :)
"""
LESSON_CARD_Q1 = """Если ваш ученик стоит на паузе, то не стоит переживать.
Это означает, что у ученика или нет оплаты,
или какая-то иная ситуация от клиента(заболели, отпуск, каникулы и т.д.) по которой они не смогу присутствовать на уроке и заранее предупредили"""
LESSON_CARD_Q2 = """Если у вас стоит отмеченный урок, но вы его не отмечали и/или не проводили, то это значит тоже что и пауза,
но только оплата у клиента есть. 
Т.е. клиент предупредил, что не сможет присуствовать по какой-либо причине.
"""
LESSON_CARD_Q3 = """Чтобы посмотреть какой предмет и номер урока у ученика, достаточно зайти в карточку урока. 
Справа можно узнать какой у ученика модуль (предмет), а если зайти в предыдущий урок (если это не ПУ), то можно в поле "Номер урока" увидеть на каком уроке остановился ученик.
"""
LESSON_CARD_Q4 = """Менеджеры М3 указываются в превью карточки (если просто нажать на урок).

М3 - это менеджеры, которые продают курс клиентам после вашего пробного урока. 
Их нужно позвать в конце ПУ за 5-10 минут до конца и дождаться пока он подключиться и плавно передать клиента менеджеру.
Более подробно можно ознакомиться по ссылке ниже.

https://www.notion.so/rtschool/3-2050659c9fa844488dece05fe85aeaa4
"""
PROGRAMS_Q1 = """
Если ты записывал через Google Meet и не можешь найти свою запись, то снизу находится видео, которое тебе поможет с решением твоего вопроса

https://share.vidyard.com/watch/GZZgHbXMgtNzXNcJpsnwZb?
"""
PROGRAMS_Q2 = """
Если ты хочешь записывать уроки в Google Meet и не знаешь как это делать, то снизу находится видео, которое тебе поможет с решением твоего вопроса

https://share.vidyard.com/watch/BBX5gy2w5m7VxcHg9qguYp
"""
PROGRAMS_Q3 = """
Если ты не знаешь как пользоваться сервисом Google Meet для проведения урока, то снизу находится видео, которое тебе поможет с решением твоего вопроса

https://www.youtube.com/watch?v=ZaqBfcS11bw
"""
PROGRAMS_Q4 = """
Если тебе поставили твой первый регулярный урок, но ты не знаешь где его проводить, то снизу находится видео, которое тебе поможет с решением твоего вопроса

https://www.notion.so/rtschool/Discord-aba94cf31ffb4ca7b1e99e34a913f3df
"""
TECH_PROBLEM_Q1  = """
Если за час до урока ни на одном серверов RTS нет вашего текстового и/или канала, то вы просто можете посмотреть статус интересующей вас задачи в карточке клиента в Alfa CRM, во вкладке “Задачи”.

Если статус "выполнен", то можете обратиться в чат #tech_support, чтобы вас добавили в каналы. 

Если статус задачи еще в работе, то будьте готовы проводить урок в Google Meet (нужно самостоятельно создать встречу)
и кинуть ссылку на урок ученику через WhatsApp.

По ссылке ниже можно прочитать как правильно обратиться к технической поддержке и по каким случаям.

https://www.notion.so/rtschool/66b55efbf34e42dd9a77bacaef64ea14
"""
TECH_PROBLEM_Q2  = """
Если ты уже Юный падаван и выше, то тебе нужно обратиться к своему TeamLead и попросить командный корпоративный аккаунт.

Если ты еще Юнлинг, то вот инструкция как зайти в аккаунт:
https://www.notion.so/rtschool/790d0182056b478d96fd98cfb5fabd2e
"""
TECH_PROBLEM_Q3  = """
Чтобы подключить коорпоративный Вазап, нужно написать Lakiza Ilya#7777 в дискорд и он вышлет все инструкции для подключения корпоративного Wazzup.


https://docs.google.com/document/d/1qTq2At9IiVeeXVtRjhsL7PUSfEcnltEDv7LTN7JPyHQ/edit
"""
TIME_Q1  = """
Часы работы отделов:

Продукт: ТЛ продукта с вск по чт с 10 до 18

Админы: с 7 утра до 3 ночи

Техподдержка: с 10 утра до 3 ночи

Дежурный М1 (@duty): со времени первого урока и до 22-23 ночи

Тимлиды: можно посмотреть график ТЛ в дискорде

Менеджер обучения: с пн по пт с 11 до 19
"""
ANOTHER = """
Если ты не нашел нужный урок или тебе не хватило того, что тут имеется, то можешь обратиться в чат teacher_problems
с тегом @teacher_quality и запросить нужный тебе урок

"""
MORE8H = """Внезависимости от типа урока - компенсации нет.

Ставим отмену более 8 часов в AlfaCRM"""

LESS8H = """В таком случае компенсация педагогу есть в размере:
-----------------
Если индивидульный урок(50/80мин):
3$ без надбавок.
-----------------
Если групповой:
Оплата за кол-во присутствующих учеников на уроке 
             +
Ученики с отменой менее 8 часов/1-ый пропуск
-------------------------
Ставим отмену менее 8 часов в AlfaCRM"""

FORCE_MAJOR = """У каждого бывают разные ситуации и к каждому нужно относится с пониманием.
Поэтому если у клиента заболел ребенок или случилось ЧП и выключили электричество, то в таких случаях
в AlfaCRM ставим 'Форс-мажор'.

Компенсации за такую отмену педагогу нет."""

FIRST_CANCEL = """Наша школа прощает клиентам первый пропуск занятий, но педагогу есть компенсация:
-----------------
Если индивидульный урок(50/80мин):
3$ без надбавок.
-----------------
Если групповой:
Оплата за кол-во присутствующих учеников на уроке 
             +
Ученики с отменой менее 8 часов/1ый пропуск
-------------------------
В AlfaCRM ставим '1-ый пропуск'

"""
TEXT_MIDDLE_OS = """
Добрый день,**(Имя родителя)**!

На связи **(Ваше имя)**, я преподаватель **(предмета)** школы RTS.

Хочу поделиться успехами **(Имя ребенка)** на уроках.

Мы провели 4 урока и **(Имя ребенка)** научился/лась____________________. **(даем кратко и понятным языком)**
У _________хорошо получается _____________.

Также он/а очень внимателен/а и старателен/а.
Также он/а очень творчески подходит к заданиям и не боится экспериментировать. 
Также он/а отлично работает самостоятельно.

Есть несколько моментов, на которые **(Имя ученика)** нужно обратить больше внимания:

- тема ____ далась сложнее остальных, нам нужно уделить ей больше внимания
- ______ испытывает сложности с изучением некоторых тем. Рекомендую _________.
- домашнее задание: _____ не всегда выполняет его, а без закрепления материала он может очень быстро забываться.
- ______ иногда позже подключается к уроку, из-за чего мы не всегда успеваем полноценно провести урок, это может влиять на эффективность обучения.
- и т.п.

(Имя ученика) всегда активен/а на уроках,чувствуется, что ей/ему нравится заниматься

На следующих занятиях мы хотим сделать упор на __________________ .

Есть ли у вас какие-то вопросы или пожелания по нашим занятиям?
"""

TEXT_END_OS = """
Добрый день, **(Имя родителя)**!На связи **(ваше имя)** , я преподаватель **(предмета)** школы RTS. Хочу поделиться с вами результатами модуля и  успехами **(имя ребенка)** на уроках.

На текущем модуле обучения мы разобрали темы:______

Нашим проектом было _______________. 
Ниже я прикреплю скриншоты проекта.У ________ отличные способности к ____________. (название предмета).
Особенно хорошо у него/нее получается ____________.
На следующем модуле мы будем создавать **(проект след. модуля)**.
Есть ли у вас какие-то вопросы или комментарии по нашим занятиям?
"""

TEXT_DFCLT_OS = """
Добрый день,**(Имя родителя)**!

На связи **(Ваше имя)**, я преподаватель **(предмета)** школы RTS.
Хотела бы дать вам обратную связь по нашим урокам с **(Имя ребенка)**.

На начальных этапах прогресс шел немного медленней, потому что, как я понимаю, это совсем новая для него/неё сфера. Так бывает у многих. Поэтому мы тратили на каждый урок больше времени. 

Но могу сказать, что примерно **на (пятой)** теме стал заметен очевидный прогресс. Сейчас он(а) может самостоятельно писать программы по темам, которые мы прошли.

Возникали сложности с **(циклами)** и некоторыми более сложными программами, которые требуют более глубокого анализа. В целом быстрое решение таких задач требует практики. Как я поняла, самостоятельной практики вне занятий не так много, поэтому я стараюсь компенсировать это на занятиях, давая ему/ей возможность рассуждать и пробовать самостоятельно. По моему мнению, это более эффективно, чем просто давать готовое решение. 

**(Имя ребенка)** молодец, очень старается на занятиях. На данный момент темп довольно ровный, и на урок мы тратим столько времени, сколько было запланировано. 

Есть ли у вас какие-то вопросы или комментарии по нашим занятиям?
"""


TEXT_ADMIN_SCRIPT = "`@Admins *ссылка на карточку ученика* перенесите, пожалуйста, занятие, с *дата* на *дата* на *постоянной основе/единоразово*. Спасибо!`"
TEXT_M1_SCRIPT = "`@duty *ссылка на карточку ученика* перенесите, пожалуйста, занятие на *другой преподаватель*. Спасибо!`"
MEMBER_JOIN_TEXT = """
Привеееет!👋
Меня зовут **Rocket Helper** и я буду твоим **первым другом** на этом сервере!👽
Я живу во всех каналах сервера **Rocket Tech School** и могу тебе помогать с очень разными, а порой и рутинными задачами. 💪 
Когда тебе выдадут твою роль, то на нашем сервере у тебя будет возможность со мной взаимодействовать.
И для того, чтобы это сделать, тебе **нужно написать "/cmd @Rocket Helper"** в любом доступном тебе текстовом канале и ты получишь краткий cписок команд как со мной взаимодействовать!

**Я всегда на связи, так что жду твоих сообщений** 🚀
"""


EMBED_FOOTER_ =  ['⚠️Если ты нашел ошибку, \nто сообщи об этом через /feedback']
                

EMBED_FOOTER =  [
                '<💻Code my Future/>',
                '👽Powered by RTS'
                ]
